<a href="https://colab.research.google.com/github/brittmw/CSC302_HW1/blob/main/CSC302_HW1_Group2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
df = pd.read_csv('/content/drive/MyDrive/DATA/olympic_medals.csv')

In [ ]:
size = df.shape
print (size)

(2394, 8)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2394 entries, 0 to 2393
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Gender       2394 non-null   object
 1   Event        2394 non-null   object
 2   Location     2394 non-null   object
 3   Year         2394 non-null   int64
 4   Medal        2394 non-null   object
 5   Name         2164 non-null   object
 6   Nationality  2394 non-null   object
 7   Result       2351 non-null   object
dtypes: int64(1), object(7)
memory usage: 149.8+ KB

In [ ]:
len(df['Location'].unique())

23

In [ ]:
df[df['Nationality'] == 'USA'].value_counts()

Gender  Event             Location   Year  Medal  Name              Nationality  Result
M       10000M Men        London     2012  S      Galen RUPP        USA          27:30.90    1
        Long Jump Men     Stockholm  1912  G      Albert GUTTERSON  USA          7.6         1
                          Rio        2016  G      Jeff HENDERSON    USA          8.38        1
                          Rome       1960  G      Ralph BOSTON      USA          8.12        1
                                           S      Irvin ROBERSON    USA          8.11        1
                                                                                            ..
        400M Hurdles Men  Rome       1960  B      Richard HOWARD    USA          49.7        1
                          Rio        2016  G      Kerron CLEMENT    USA          47.73       1
                          Paris      1924  G      Morgan TAYLOR     USA          52.6        1
                                           B      Ivan RILEY        USA          54.2        1
W       Shot Put Women    Rome       1960  B      Earlene BROWN     USA          16.42       1
Name: count, Length: 566, dtype: int64

In [ ]:
df[df['Nationality'] == 'USA'].value_counts().sum()

566

In [ ]:
df.groupby(by='Nationality')['Medal'].count()

Nationality
ALG      9
ARG      4
AUS     57
AUT      4
BAH     12
      ...
URS    131
USA    638
VEN      2
YUG      1
ZAM      1
Name: Medal, Length: 97, dtype: int64